* Instituto de Pesquisa Econômica Aplicada
** Searching in the database

#+BEGIN_SRC python :session :exports both
from seriesbr import ipea

ipea.search(BASNOME="Macroeconômico", PERNOME="Mensal", UNINOME="(p.p.)")
#+END_SRC

#+RESULTS:
#+begin_example
             SERCODIGO                                                                  SERNOME PERNOME UNINOME         BASNOME
0   BM12_CRDSD12        Operações de crédito - recursos direcionados - spread                    Mensal  (p.p.)  Macroeconômico
1   BM12_CRDSDPF12      Operações de crédito - recursos direcionados - spread - pessoa física    Mensal  (p.p.)  Macroeconômico
2   BM12_CRDSDPJ12      Operações de crédito - recursos direcionados - spread - pessoa jurídica  Mensal  (p.p.)  Macroeconômico
3   BM12_CRLSD12        Operações de crédito - recursos livres - spread                          Mensal  (p.p.)  Macroeconômico
4   BM12_CRLSDPF12      Operações de crédito - recursos livres - spread - pessoa física          Mensal  (p.p.)  Macroeconômico
5   BM12_CRLSDPJ12      Operações de crédito - recursos livres - spread - pessoa jurídica        Mensal  (p.p.)  Macroeconômico
6   BM12_CSD12          Operações de crédito - spread                                            Mensal  (p.p.)  Macroeconômico
7   BM12_CSDPF12        Operações de crédito - spread - pessoa física                            Mensal  (p.p.)  Macroeconômico
8   BM12_CSDPJ12        Operações de crédito - spread - pessoa jurídica                          Mensal  (p.p.)  Macroeconômico
9   VALOR12_GLOBAL1212  Bônus global República (12) - spread                                     Mensal  (p.p.)  Macroeconômico
10  VALOR12_GLOBAL2412  Bônus global República (24) - spread                                     Mensal  (p.p.)  Macroeconômico
11  VALOR12_GLOBAL2712  Bônus global República (27) - spread                                     Mensal  (p.p.)  Macroeconômico
12  VALOR12_GLOBAL4012  Bônus global República (40) - spread                                     Mensal  (p.p.)  Macroeconômico
13  VALOR12_GLOBAL912   Bônus global República (9) - spread                                      Mensal  (p.p.)  Macroeconômico
14  VALOR12_TJCBOND12   C-Bond - spread                                                          Mensal  (p.p.)  Macroeconômico
#+end_example

Another example:

#+BEGIN_SRC python :session :exports both
  ipea.search("Juros", PERNOME="Mensal", UNINOME="(% a.m.)")
#+END_SRC

#+RESULTS:
#+begin_example
            SERCODIGO                                                           SERNOME PERNOME   UNINOME
0   ANBIMA12_TJCDBP12  Taxa de juros - CDB pré-fixado                                    Mensal  (% a.m.)
1   BM12_TJCDBN12      Taxa de juros - CDB                                               Mensal  (% a.m.)
2   BM12_TJCDI12       Taxa de juros - CDI / Over                                        Mensal  (% a.m.)
3   BM12_TJLCMN12      Taxa de juros - letras de câmbio ao mutuário                      Mensal  (% a.m.)
4   BM12_TJLCTN12      Taxa de juros - letras de câmbio ao tomador                       Mensal  (% a.m.)
5   BM12_TJLP12        Taxa de juros - TJLP                                              Mensal  (% a.m.)
6   BM12_TJOVER12      Taxa de juros - Over / Selic                                      Mensal  (% a.m.)
7   BM12_TJTBAN12      Taxa de juros - TBAN                                              Mensal  (% a.m.)
8   BM12_TJTBC12       Taxa de juros - TBC                                               Mensal  (% a.m.)
9   BM12_TJTBF12       Taxa de juros - TBF                                               Mensal  (% a.m.)
10  BM12_TJTR12        Taxa de juros - TR                                                Mensal  (% a.m.)
11  DIESP12_GIRO12     Taxa de juros - crédito - capital de giro - fim período           Mensal  (% a.m.)
12  GM12_TJLFT12       Taxa de juros - Letras do Tesouro Nacional - financeiras (LFT)    Mensal  (% a.m.)
13  IBMEC12_OTNRTJ12   Taxa de juros - obrigações reajustáveis do Tesouro Nacional       Mensal  (% a.m.)
14  IBMEC12_TJEMP12    Taxa de juros paga pelo tomador do empréstimo por aceite cambial  Mensal  (% a.m.)
15  IBMEC12_TJLM12     Taxa de juros - letras imobiliárias                               Mensal  (% a.m.)
16  IBMEC12_TJTIT12    Taxa de juros - letras de câmbio                                  Mensal  (% a.m.)
#+end_example

Or even:

#+BEGIN_SRC python :session :exports both
  ipea.search(FNTNOME="Instituto", PERNOME="mensal", SERNOME="Preço")
#+END_SRC

#+RESULTS:
#+begin_example
         SERCODIGO                                                                       SERNOME PERNOME   UNINOME                                                                                                            FNTNOME
0  GAC12_CARN12     Commodities - carnes - preço - índice (jan. 2002 = 100)                       Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
1  GAC12_COMMO12    Commodities - geral - preço - índice (jan. 2002 = 100)                        Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
2  GAC12_EXPETR12   Commodities - geral (exceto petróleo) - preço - índice (jan. 2002 = 100)      Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
3  GAC12_GRAO12     Commodities - grãos, oleaginosas e frutas - preço - índice (jan. 2002 = 100)  Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
4  GAC12_MATPRIM12  Commodities - materias primas - preço - índice (jan. 2002 = 100)              Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
5  GAC12_MIN12      Commodities - minerais - preço - índice (jan. 2002 = 100)                     Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
6  GAC12_PETROL12   Commodities - petróleo e derivados - preço - índice (jan. 2002 = 100)         Mensal  -         Instituto de Pesquisa Econômica Aplicada (Ipea)                                                                  
7  INPC             INPC - Índice Nacional de  Preços ao  Consumidor                              Mensal  None      Instituto Brasileiro de Geografia e Estatística(IBGE)                                                            
8  PAN12_IPCAG12    Índice de Preços ao Consumidor Ampliado (IPCA)                                Mensal  (% a.a.)  Instituto Brasileiro de Geografia e Estatística, Sistema Nacional de Índices de Preços ao Consumidor (IBGE/SNIPC)
#+end_example

** Valid filters

| BASNOME        | Series' metadata                               |
|----------------+------------------------------------------------|
| SERNOME        | Name                                           |
| SERCODIGO      | Code                                           |
| PERNOME        | Frequency                                      |
| TEMCODIGO      | Theme code                                     |
| UNINOME        | Unit measure                                   |
| PAICODIGO      | Location code                                  |
| SERATUALIZACAO | Last updated                                   |
| MULNOME        | Multiplicative factor                          |
| SERCOMENTARIO  | Notes/comments, in portuguese                  |
| FNTNOME        | Source's name, in portuguese                   |
| FNTSIGLA       | Source's initials                              |
| FNTURL         | Source's url                                   |
| SERSTATUS      | Still being updated (1), not being updated (0) |
| SERNUMERICA    | Numeric (1), alphanumeric (0)                  |

** Lists of metadata codes

#+BEGIN_SRC python :session :exports both
  ipea.list_themes()  # also available: list_countries
#+END_SRC

#+RESULTS:
#+begin_example
    TEMCODIGO  TEMCODIGO_PAI                 TEMNOME
0   28        NaN             Agropecuária          
1   23        NaN             Assistência social    
2   10        NaN             Balanço de pagamentos 
3   7         NaN             Câmbio                
4   5         NaN             Comércio exterior     
.. ..          ..                           ...     
38  59         18.0           Senador               
39  17        NaN             Sinopse macroeconômica
40  33        NaN             Transporte            
41  26        NaN             Vendas                
42  60         18.0           Vereador              

[43 rows x 3 columns]
#+end_example

Supposing now we are interested in the theme of employment (at row 16, code 12), we could search for this kind of series:

#+BEGIN_SRC python :session :exports both
  ipea.search(TEMCODIGO=12)
#+END_SRC

#+RESULTS:
#+begin_example
            SERCODIGO                                                      SERNOME     PERNOME                   UNINOME  TEMCODIGO
0    ADMIS             Total da evolução de admissões                               Mensal      Pessoa                    12       
1    CAGED12_ADMIS     Empregados - admissões                                       Mensal      Pessoa                    12       
2    CAGED12_DESLIG    Empregados - demissões                                       Mensal      Pessoa                    12       
3    CAGED12_SALDO12   Empregados - saldo                                           Mensal      Pessoa                    12       
4    CN_C              Despesas com salários nas atividades da indústria extrativa  Quinquenal  R$, a preços do ano 2000  12       
..    ...                                                                      ...         ...                       ...  ..       
208  SEADE12_TDAGSP12  Taxa de desemprego - aberto - RMSP                           Mensal      (%)                       12       
209  SEADE12_TDODSP12  Taxa de desemprego - oculto - desalento - RMSP               Mensal      (%)                       12       
210  SEADE12_TDOPSP12  Taxa de desemprego - oculto - precário - RMSP                Mensal      (%)                       12       
211  SEADE12_TDOTSP12  Taxa de desemprego - oculto - RMSP                           Mensal      (%)                       12       
212  SEADE12_TDTGSP12  Taxa de desemprego - RMSP                                    Mensal      (%)                       12       

[213 rows x 5 columns]
#+end_example

** Getting multiple values

#+BEGIN_SRC python :session :exports both
  ipea.get_series({"Taxa de juros - Over / Selic": "BM12_TJOVER12", "Taxa de juros - CDB": "BM12_TJCDBN12"}, join="inner")
#+END_SRC

#+RESULTS:
#+begin_example
            Taxa de juros - Over / Selic  Taxa de juros - CDB
date                                                         
1974-01-01  1.46                          1.800000           
1974-02-01  1.15                          1.800000           
1974-03-01  1.16                          1.800000           
1974-04-01  1.21                          1.800000           
1974-05-01  1.24                          1.800000           
...          ...                               ...           
2009-06-01  0.76                          0.711593           
2009-07-01  0.79                          0.776809           
2009-08-01  0.69                          0.692135           
2009-09-01  0.69                          0.718573           
2009-10-01  0.69                          0.693355           

[430 rows x 2 columns]
#+end_example

** Getting metadata

To get metadata you would do the same as in =bcb= module.

#+BEGIN_SRC python :session :results output :exports both
  metadados = ipea.get_metadata("BM12_TJOVER12")

  metadados
#+END_SRC

#+RESULTS:
#+begin_example

values
SERCODIGO           BM12_TJOVER12                                                                                                                                                                                                                                                                                                                                                                
SERNOME             Taxa de juros - Over / Selic                                                                                                                                                                                                                                                                                                                                                 
SERCOMENTARIO       Quadro: Taxas de juros efetivas.  Para 1974-1979: fonte Andima.  Dados mais recentes atualizados pela Sinopse da Andima.  Obs.: A taxa Overnight / Selic é a média dos juros que o Governo paga aos bancos que lhe emprestaram dinheiro. Refere-se à média do mês. Serve de referência para outras taxas de juros do país. A taxa Selic é a taxa básica de juros da economia.
SERATUALIZACAO      2019-12-14T05:06:00.543-02:00                                                                                                                                                                                                                                                                                                                                                
BASNOME             Macroeconômico
...                                                                                                                                                                                                                                                                                                                                                               
SERMAXDATA          2019-12-01T00:00:00-02:00                                                                                                                                                                                                                                                                                                                                                    
FNTEXTURL           None                                                                                                                                                                                                                                                                                                                                                                         
SERPROGRAMAGERADOR  None                                                                                                                                                                                                                                                                                                                                                                         
SERDECIMAIS         4                                                                                                                                                                                                                                                                                                                                                                            
SERQNT              552                                                                                                                                                                                                                                                                                                                                                                          

[29 rows x 1 columns]
#+end_example

